import { motion } from "framer-motion";

const HomeText = () => {
  return (
    <motion.div
      className="homeText"
      initial={{ opacity: 0 }}
      whileInView={{ opacity: 1 }}
      transition={{ duration: 1, delay: 1 }}
      viewport={{ once: true }}
    >
      <h1>Καλωσορίσατε στο PawTales</h1>
      <p>
        Το μαγικό μέρος όπου ο κόσμος των ζώων ζωντανεύει μέσα από μαγευτικές
        ιστορίες και περιπέτειες σχεδιασμένες μόνο για εσάς!
      </p>
      <p>
        Σε αυτόν τον υπέροχο κόσμο, τα λιοντάρια γίνονται γενναίοι φίλοι, οι
        κουκουβάγιες σοφοί συμπαίκτες και τα πιο αξιολάτρευτα ζώα μοιράζονται
        μαζί σας τις μοναδικές τους ιστορίες.
      </p>
      <p>
        Καθώς διαβάζεις, θα ανακαλύψεις πώς τα ζώα γίνονται πραγματικοί φίλοι,
        προσφέροντας μαγικές στιγμές και διδάσκοντάς μας σημαντικά μαθήματα για
        την αγάπη, τη φροντίδα και το σεβασμό στο περιβάλλον.
      </p>
      <p>
        Ετοιμαστείτε να ξεκινήσετε ένα ταξίδι γεμάτο περιπέτειες, γέλιο και
        συγκινητικές στιγμές με τα αγαπημένα μας ζωάκια.
      </p>
    </motion.div>
  );
};

export default HomeText;
