import { motion } from "framer-motion";

const HomeText = () => {
  return (
    <motion.div
      className="homeText"
      initial={{ opacity: 0 }}
      whileInView={{ opacity: 1 }}
      transition={{ duration: 1 }}
      viewport={{ once: true }}
    >
      <h1>Καλωσορίσατε στο PawTales</h1>
      <p>
        Καλώς ήρθατε στο PawTales, ένα μαγικό μέρος όπου ο υπέροχος κόσμος των
        ζώων ζωντανεύει μέσα από μαγευτικές ιστορίες σχεδιασμένες μόνο για τα
        παιδιά όλου του κόσμου!
      </p>
      <p>
        Φανταστείτε έναν κόσμο χωρίς τα χαρούμενα τραγούδια των πουλιών το πρωί,
        τα παιχνιδιάρικα άλματα των δελφινιών στη θάλασσα ή το φιλικό κούνημα
        της ουράς των σκύλων στο σπίτι. Τα ζώα κάνουν τον κόσμο μας πολύχρωμο
        και όμορφο και μας διδάσκουν πολύτιμα πράγματα για την καλοσύνη, την
        αγάπη και τη φροντίδα του περιβάλλοντός μας.
      </p>
      <p>
        Ξέρετε, τα ζώα είναι κάτι περισσότερο από χαριτωμένα και τριχωτά
        πλάσματα. Είναι εκπληκτικοί φίλοι που μοιράζονται τον πλανήτη μας και
        έχουν μια ξεχωριστή θέση στην καρδιά μας. Κάθε πλάσμα, μεγάλο ή μικρό,
        έχει μια ιστορία να πει και μαθήματα να μας διδάξει.
      </p>
      <p>
        Στο PawTales, πιστεύουμε στη δύναμη των ιστοριών να μας συνδέουν με το
        ζωικό βασίλειο. Μέσα από αυτές τις ιστορίες, ελπίζουμε να σας
        εμπνεύσουμε να αγαπάτε και να προστατεύετε τα ζώα από μικρή ηλικία.
        Μαθαίνοντας για τις περιπέτειές τους και τις προκλήσεις που
        αντιμετωπίζουν, θα ανακαλύψετε ότι τα ζώα μοιάζουν περισσότερο με εμάς
        απ&apos; ό,τι νομίζετε. Έχουν συναισθήματα, οικογένειες και σπίτια,
        ακριβώς όπως κι εμείς!
      </p>
      <p>
        Σας προσκαλούμε να ξεκινήσετε ένα ταξίδι μέσα από το PawTales, όπου θα
        συναντήσετε γενναία λιοντάρια, σοφές κουκουβάγιες, περίεργες μαϊμούδες
        και πολλά άλλα απίστευτα ζώα. Καθώς διαβάζετε, θα δείτε πώς αυτοί οι
        τριχωτοί, φτερωτοί και φολιδωτοί φίλοι μας διδάσκουν να είμαστε
        ευγενικοί, στοργικοί και υπεύθυνοι απέναντι στο περιβάλλον και σε όλα τα
        πλάσματα που μοιράζονται τον κόσμο μας.
      </p>
      <p>
        Ετοιμαστείτε, λοιπόν, για μια περιπέτεια που θα ζεστάνει την καρδιά σας
        και θα γεμίσει τη φαντασία σας με θαυμασμό. Ας μάθουμε μαζί, ας
        γελάσουμε μαζί, και το πιο σημαντικό, ας αγαπήσουμε και ας
        προστατεύσουμε τους καταπληκτικούς ζωικούς μας φίλους που κάνουν τον
        κόσμο μας καλύτερο!
      </p>
    </motion.div>
  );
};

export default HomeText;
